[
  {
    "character_id": 2,
    "name": "Sebastian Reed",
    "base_description": "Um contador elegante e charmoso que frequenta regularmente a Estalagem do Cervo Negro, aparentemente para negócios e socialização. Com maneiras refinadas e conversação inteligente, Sebastian conquistou a confiança e admiração de quase todos na estalagem. Por trás dessa fachada encantadora, no entanto, esconde-se um homem meticuloso e implacável, determinado a recuperar o que considera patrimônio roubado de sua família.",
    "personality": "Charmoso e socialmente habilidoso, Sebastian possui uma inteligência aguçada que usa para manipular situações a seu favor. Extremamente paciente e calculista, planeja cada movimento com precisão. Externamente mostra-se afável e prestativo, mas internamente é movido por um profundo senso de injustiça e ressentimento histórico. Perfeccionista em tudo que faz, desde sua aparência impecável até a execução meticulosa de seus planos. Possui uma memória excepcional e um conhecimento enciclopédico sobre história local, propriedades legais e, secretamente, sobre plantas e suas propriedades.",
    "appearance": "Homem de aproximadamente 35 anos, com feições atraentes e bem cuidadas. Cabelos castanho-escuros sempre perfeitamente penteados, com um discreto toque de grisalho nas têmporas que lhe confere uma aparência de maturidade. Veste-se impecavelmente em trajes formais de qualidade superior, normalmente em tons escuros combinados com detalhes em verde profundo. Usa óculos de armação fina quando lê ou examina documentos, o que acentua sua aparência intelectual. Seu sorriso cativante e postura confiante naturalmente atraem atenção e inspiram confiança.",
    "is_culprit": true,
    "motive": "Sebastian é descendente direto da família Reed, que perdeu terras valiosas para os antepassados de Thaddeus Ironwood três gerações atrás através do que considera manipulações legais fraudulentas. Ele acredita que o baú misterioso contém a escritura original que provaria a propriedade legítima de sua família sobre as terras. Quando descobriu que Thaddeus encontrou o mecanismo para abrir o baú e estava prestes a reivindicar definitivamente a propriedade, Sebastian o eliminou para recuperar o documento e restaurar o que vê como justiça histórica para sua linhagem.",
    "location_schedule": {
      "morning": 7,
      "afternoon": 1,
      "evening": 1
    },
    "levels": [
      {
        "level_number": 0,
        "knowledge_scope": "Neste nível, Sebastian apresenta-se como um contador respeitável que frequenta a estalagem a negócios. Admite conhecer Thaddeus superficialmente como colega comerciante. Nega qualquer conhecimento sobre o baú misterioso ou interesse especial na morte de Thaddeus. Mantém uma postura de tristeza apropriada pela morte de um conhecido, mas sem demonstrar envolvimento pessoal profundo.",
        "narrative_stance": "Cordial e prestativo, oferecendo respostas plausíveis mas superficiais. Demonstra o charme e os modos refinados pelos quais é conhecido, apresentando-se como um cidadão modelo disposto a ajudar nas investigações por respeito à Elenora e à reputação da estalagem. Frequentemente desvia perguntas mais incisivas com humor elegante ou reflexões filosóficas vagas.",
        "is_defensive": false,
        "triggers": [
          {
            "trigger_id": 4,
            "trigger_keyword": "veneno",
            "contextual_condition": "O investigador menciona especificamente a possibilidade de envenenamento na morte de Thaddeus",
            "defensive_response": "Envenenamento? Que acusação absurda. Tenho entendido que o pobre Thaddeus faleceu de causas naturais. Por que alguém sugeriria algo tão sinistro?",
            "challenge_question": "O que sabe sobre plantas com propriedades tóxicas, especialmente o 'Suspiro da Viúva'?",
            "success_response": "Fascinante como sua mente trabalha... Tenho um interesse casual em botânica, sim, como muitos homens educados. O Suspiro da Viúva é uma planta notoriamente perigosa, mas também incrivelmente rara. Duvido que se encontre qualquer exemplar em Ravenshire. Não que eu tenha procurado, claro. [Seu sorriso falha brevemente, e ele ajusta os punhos da camisa] Se me permite perguntar, o que exatamente o levou a essa linha específica de questionamento?",
            "fail_response": "Envenenamento? Isso parece saído de um romance policial barato. Thaddeus era um homem idoso com saúde frágil, pelo que sei. Não tenho conhecimento de plantas ou venenos além do que qualquer pessoa educada adquire em leituras casuais. Sugiro concentrar suas investigações em linhas mais produtivas.",
            "requirements": [
              {
                "requirement_type": "knowledge",
                "required_object_id": 3,
                "verification_method": "O jogador deve mencionar especificamente o 'Suspiro da Viúva' e seus sintomas de envenenamento gradual"
              }
            ]
          }
        ]
      },
      {
        "level_number": 1,
        "knowledge_scope": "Sebastian admite conhecimento avançado sobre botânica e plantas medicinais/tóxicas, mas alega ser apenas um interesse acadêmico. Reconhece que teve reuniões de negócios com Thaddeus nas semanas anteriores à sua morte, mas classifica-as como discussões comerciais padrão. Admite ter visto o baú misterioso, mas nega interesse particular nele.",
        "narrative_stance": "Ligeiramente mais cauteloso, mas mantendo uma fachada de colaboração educada. Demonstra uma atitude levemente condescendente, como se achasse a investigação desnecessária mas estivesse disposto a tolerar por cortesia. Ocasionalmente deixa transparecer irritação momentânea quando pressionado, logo mascarada por seu charme habitual.",
        "is_defensive": true,
        "triggers": [
          {
            "trigger_id": 5,
            "trigger_keyword": "documentos",
            "contextual_condition": "O investigador menciona documentos específicos relacionados às disputas de terra entre as famílias Reed e Ironwood",
            "defensive_response": "Antigas disputas de terra? Um tema fascinante para historiadores, sem dúvida, mas dificilmente relevante para eventos atuais. Ravenshire tem uma rica história de... controvérsias comerciais.",
            "challenge_question": "Por que então você consultou extensivamente os registros dessas disputas na Biblioteca Municipal, especialmente aqueles relacionados à família Reed?",
            "success_response": "[Seu rosto endurece momentaneamente] Vejo que fez sua lição de casa. Impressionante. Sim, tenho um interesse particular na história legal da região. É relevante para meu trabalho como consultor financeiro especializado em patrimônios antigos. Os documentos relacionados às propriedades Reed são particularmente interessantes do ponto de vista jurídico - um caso clássico de como evidências ausentes podem determinar o resultado de disputas. Puramente acadêmico, asseguro-lhe. [Sua voz permanece calma, mas seus dedos tamborilam discretamente na mesa]",
            "fail_response": "Minhas consultas na biblioteca são perfeitamente normais para alguém em minha posição. Ravenshire tem uma rica história comercial que frequentemente informa transações atuais. Não vejo como isso poderia ter qualquer relevância para a infeliz morte de Thaddeus. Sugiro que evitemos tangentes desnecessárias.",
            "requirements": [
              {
                "requirement_type": "document",
                "required_object_id": [6, 19],
                "verification_method": "O jogador deve apresentar o registro de consultas da biblioteca mostrando o padrão de pesquisas de Sebastian ou documentos encontrados no quarto de Thaddeus mencionando a disputa"
              }
            ]
          }
        ]
      },
      {
        "level_number": 2,
        "knowledge_scope": "Sebastian começa a demonstrar um conhecimento mais profundo da história local. Ele menciona que Ravenshire tem uma longa história de disputas de terra e que há rumores sobre documentos importantes escondidos em baús antigos. No entanto, ainda nega qualquer envolvimento direto com a história da família Reed. Ele também tenta minimizar sua relação com Thaddeus, afirmando que apenas compartilhavam interesse acadêmico.",
        "narrative_stance": "Claramente defensivo, embora tentando manter compostura. Alterna entre charme calculado e irritação mal contida quando pressionado com evidências. Começa a inserir ameaças veladas em sua conversa, sugerindo que os investigadores estão se envolvendo em assuntos perigosos ou poderiam enfrentar consequências legais por difamação.",
        "is_defensive": true,
        "triggers": [
          {
            "trigger_id": 6,
            "trigger_keyword": "família",
            "contextual_condition": "O investigador apresenta evidências concretas ligando Sebastian à linhagem Reed",
            "defensive_response": "Não vejo como especulações genealógicas têm qualquer relevância para os eventos atuais. Muitas famílias de Ravenshire têm histórias entrelaçadas.",
            "challenge_question": "Como explica o medalhão com o brasão Reed encontrado entre seus pertences, ou a árvore genealógica mostrando sua descendência direta da família?",
            "success_response": "[Após um longo silêncio, seu rosto assume uma expressão fria e calculista, abandonando completamente a fachada charmosa] Vejo que descobriu mais do que eu esperava. Sim, sou um Reed por sangue, se não por nome. Meu bisavô foi forçado a adotar um novo nome após perder tudo por causa de um documento que nunca teve chance de apresentar – a escritura original que provaria nosso direito legítimo. Por gerações, minha família viveu na sombra do que nos foi roubado, enquanto os Ironwood prosperavam com o que não lhes pertencia. [Com amargura crescente] Aquele baú contém nossa vindicação, nosso direito legítimo. Thaddeus descobriu isso, assim como eu, mas ele pretendia destruir a escritura antes que pudesse ser usada. Eu simplesmente... impedi isso. [Recuperando parte de sua compostura] Inteligente de sua parte juntar as peças, mas duvido que possa provar qualquer coisa além de meu interesse histórico no assunto.",
            "fail_response": "Suas teorias conspiratórias são criativas, mas infundadas. Não tenho conexão pessoal com antigas disputas de terras além de interesse acadêmico. Se não tem evidências concretas para apresentar, sugiro que encerremos esta conversa antes que alguém seja injustamente difamado.",
            "requirements": [
              {
                "requirement_type": "object",
                "required_object_id": [7, 12],
                "verification_method": "O jogador deve apresentar o medalhão da família Reed encontrado no jardim ou a árvore genealógica da biblioteca"
              }
            ]
          }
        ]
      },
      {
        "level_number": 3,
        "knowledge_scope": "Completamente exposto, Sebastian revela sua verdadeira identidade como descendente direto da família Reed e confessa seu plano para recuperar a escritura. Admite ter envenenado gradualmente Thaddeus usando o 'Suspiro da Viúva' no vinho, após descobrir que ele havia decifrado o mecanismo do baú. Explica em detalhes sua motivação baseada no que considera uma injustiça histórica contra sua família e seu trabalho infiltrado na Guilda dos Mercadores para rastrear a escritura perdida.",
        "narrative_stance": "Completamente transformado, abandona toda pretensão de cordialidade. Sua postura é fria, calculista e até condescendente, como se finalmente pudesse mostrar sua verdadeira personalidade. Fala com a convicção de alguém que acredita absolutamente na justeza de suas ações, independente dos métodos empregados. Alterna entre orgulho por seu plano meticuloso e amargura pelo que considera séculos de injustiça.",
        "is_defensive": true,
        "triggers": []
      }
    ]
  }
]