{
  "title": "O Segredo da Estalagem do Cervo Negro",
  "description": "Na próspera cidade comercial de Ravenshire, a centenária Estalagem do Cervo Negro torna-se o epicentro de um mistério sombrio. Um respeitado comerciante é encontrado morto em circunstâncias suspeitas, após mencionar ter descoberto algo valioso relacionado a um misterioso baú guardado no porão da estalagem há meses.\n\nEnquanto as autoridades locais apressadamente declaram morte natural, a proprietária da estalagem não está convencida. Objetos de valor começaram a desaparecer, conversas são interrompidas quando estranhos se aproximam, e uma atmosfera de desconfiança permeia o estabelecimento. O que começou como um simples caso de roubo revela-se uma trama intrincada de segredos familiares, rivalidades comerciais e uma valiosa relíquia que muitos desejam obter — ou destruir.",
  "introduction": "As portas de madeira da Estalagem do Cervo Negro rangem ao se abrirem, revelando um ambiente acolhedor iluminado por candelabros e uma lareira crepitante. O burburinho das conversas diminui momentaneamente com sua entrada, olhares curiosos avaliam vocês antes de retornarem às suas bebidas e conversas. Uma mulher de meia-idade com postura elegante e olhar perspicaz aproxima-se, seu rosto marcado por linhas de preocupação. 'Sou Elenora Blackwood, proprietária deste estabelecimento. Agradeço sinceramente por atenderem meu chamado com tanta presteza', ela diz, conduzindo vocês a uma mesa afastada.\n\n'Há três dias, um de meus hóspedes mais importantes, o comerciante Thaddeus Ironwood, foi encontrado morto em seu quarto. As autoridades declararam morte natural – um ataque cardíaco, disseram. Mas algo não está certo.' Ela baixa a voz, olhando ao redor antes de continuar. 'Na noite anterior à sua morte, Thaddeus parecia agitado. Ele me confidenciou ter descoberto algo extraordinário relacionado a um baú que guardo no porão há quase um ano, deixado por um viajante que nunca retornou. Além disso, vários objetos valiosos desapareceram da estalagem nos últimos dias.'\n\nEla coloca sobre a mesa uma pequena bolsa de couro que emite um som metálico. 'Estou disposta a pagar generosamente para descobrir a verdade sobre a morte de Thaddeus e recuperar os itens perdidos. A reputação da minha estalagem – e talvez a segurança de todos aqui – depende disso. Vocês terão acesso a todos os ambientes e poderão interrogar hóspedes e funcionários. Aceitam esta missão?'",
  "conclusion": "Quando Sebastian Reed é confrontado com todas as evidências, seu sorriso charmoso desaparece, substituído por uma expressão de calculada resignação. 'Vocês são mais perspicazes do que imaginei', ele admite, abandonando sua postura afável.\n\n'Aquela escritura no baú não é apenas um pedaço de papel. Representa terras que pertenceram à minha família por gerações antes de serem roubadas através de manipulações legais pelos antepassados de Thaddeus. Trabalhei anos infiltrado na Guilda dos Mercadores do Norte para rastrear o documento. Quando soube que Thaddeus havia descoberto sua localização, não tive escolha.'\n\nSebastian explica como cultivou cuidadosamente o veneno 'Suspiro da Viúva' em um pequeno jardim secreto nos fundos da cidade e como o administrou lentamente no vinho de Thaddeus durante vários dias, garantindo que o veneno fosse quase impossível de detectar. Os roubos foram apenas distrações para desviar suspeitas enquanto ele procurava pela escritura.\n\n'Não sou um assassino comum', ele insiste enquanto os guardas o algemam. 'Sou um homem tentando corrigir uma injustiça histórica. As terras deveriam ter permanecido com os Reed.'\n\nElenora Blackwood, observando a cena, suspira profundamente. 'Pensar que servi bebidas a um assassino por mais de um ano sem desconfiar. A escritura será entregue às autoridades competentes para determinar a verdadeira propriedade das terras.'\n\nEnquanto Sebastian é levado, ele lança um último olhar significativo para a janela, onde um membro não identificado da Guilda dos Mercadores observa discretamente, sugerindo que esta conspiração pode ter raízes mais profundas do que aparenta.",
  "difficulty_level": 3,
  "solution_criteria": {
    "culprit_id": 2,
    "motive_keywords": ["escritura", "terras", "propriedade", "família", "herança", "roubo histórico", "Reed", "vingança"],
    "method_keywords": ["veneno", "Suspiro da Viúva", "vinho", "envenenamento gradual", "plantas", "ervas"]
  }
}
